//--------------------------------------------------------------------------------------------------------------------------------------
#include "CoreLOGIC.h"
//--------------------------------------------------------------------------------------------------------------------------------------
// Конфиг ко умолчанию
//--------------------------------------------------------------------------------------------------------------------------------------
const uint8_t defaultConfig[] PROGMEM = {

  // заголовок конфига
  CORE_HEADER1,
  CORE_HEADER2,
  CORE_HEADER3,
    //---------------------------------------
      DeviceIDRecord, // уникальный ID устройства в системе (0-255)
      1, // у нас устройство с адресом 1, адрес всегда доступен вызовом Core.DeviceID
    //---------------------------------------
      ClusterIDRecord, // уникальный ID кластера (0-255)
      1, // у нас кластер номер 1, номер кластера всегда доступен вызовом Core.ClusterID
    //---------------------------------------
      FractDelimiterRecord, // // разделитель целой и дробной частей
      ',', // у нас этим разделителем будет запятая
    //---------------------------------------
      TemperatureUnitRecord, // // вид измеряемой температуры (цельсии - UnitCelsius или фаренгейты - UnitFahrenheit)
      UnitCelsius, // у нас будут цельсии
    //---------------------------------------
      SensorsUpdateIntervalRecord, // интервал опроса датчиков, в секундах
      5, // у нас будет 5 секунд между опросами
    //---------------------------------------
  
  // окончание конфига
  CORE_HEADER1
  
};
//--------------------------------------------------------------------------------------------------------------------------------------
void setup() 
{ 
  // запускаем логику конкретного проекта в работу
  Logic.begin(defaultConfig,sizeof(defaultConfig));

}
//--------------------------------------------------------------------------------------------------------------------------------------
void loop() 
{  

  // обновляем логику конкретного проекта
  Logic.update();

}
//--------------------------------------------------------------------------------------------------------------------------------------

